Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/svd/PIC32CK0512SG00064.svd
               <register>
                  <name>CHNCFG4</name>
                  <description>Channel Configuration 4 (TRGSRC)</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>TRGSRC0</name>
                        <description>Channel 0 Trigger Source</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC0Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>STRIG Synchronous Trigger</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>0xD</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>0xE</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC1</name>
                        <description>Channel 1 Trigger Source</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC1Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>STRIG Synchronous Trigger</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>0xD</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>0xE</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC2</name>
                        <description>Channel 2 Trigger Source</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC2Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>STRIG Synchronous Trigger</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>0xD</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>0xE</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC3</name>
                        <description>Channel 3 Trigger Source</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC3Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>STRIG Synchronous Trigger</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>0xD</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>0xE</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC4</name>
                        <description>Channel 4 Trigger Source</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC4Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>STRIG Synchronous Trigger</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>0xD</value>
