Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/svd/PIC32CK0512SG00064.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="PORT">
         <name>PORT_SEC</name>
         <prependToName>PORT_SEC_</prependToName>
         <baseAddress>0x44801000</baseAddress>
      </peripheral>
      <peripheral>
         <name>PRM</name>
         <version>035751a0</version>
         <description>Boot ROM Controller</description>
         <baseAddress>0x4480A000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CONTROL A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>SOFTWARE RESET BIT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>ENABLE BIT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRMWS</name>
                     <description>ROM ACCESS TIME WAIT STATE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PTC</name>
         <version>037216a0</version>
         <description>Peripheral Touch Controller</description>
         <baseAddress>0x45014000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1</size>
            <usage>reserved</usage>
         </addressBlock>
         <interrupt>
            <name>PTC</name>
            <value>139</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>RSTC</name>
         <version>039261b0</version>
         <description>Reset Controller</description>
         <baseAddress>0x4400A000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCAUSE</name>
               <description>Reset Cause</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power On Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORCORE</name>
                     <description>Brown Out CORE Detector Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDREG</name>
                     <description>Brown Out VDDREG Detector Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDA</name>
                     <description>Brown Out VDDA Detector Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDIO</name>
                     <description>Brown Out VDDIO Detector Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>External Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Watchdog Reset</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYST</name>
                     <description>System Reset Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BACKUP</name>
                     <description>Backup Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUP</name>
                     <description>Lockup Reset</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKUPEXIT</name>
               <description>Backup Exit Source. Implemented only if RSTC_BACKUP_IMPLEMENTED=1</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>VBAT0</name>
                     <description>VBAT failure in backup mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC</name>
                     <description>Real Timer Counter Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBPS0</name>
                     <description>Battery Backup Power Switch</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HIB0</name>
                     <description>Hibernate</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LCKUPDIS</name>
                     <description>Lockup Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
